Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/coming_to_live_in_ireland/importing_car_into_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Importing a vehicle into Ireland
ga: Carr a iompórtáil go hÉirinn

source: • VAT, insurance, motor tax and NCT
ga: • CBL, árachas, mótarcháin agus an TNC

source: In general, all vehicles brought into Ireland are subject to Vehicle Registration Tax (VRT) and must be registered
ga: Go ginearálta, bíonn gach feithicil a iompórtáiltear isteach go hÉirinn faoi réir Cáin Chláraithe Feithiclí (CCF) agus ní mór iad a chlárú

source: If you are moving to Ireland or are already living here and you are importing a car or other vehicle, you will need to do 4 things before you can drive your vehicle in Ireland:
ga: Má tá tú ag bogadh go hÉirinn nó má tá cónaí ort anseo cheana agus carr nó feithicil eile á hiompórtáil isteach sa tír agat, beidh ort ceithre rud a dhéanamh sular féidir leat an fheithicil a thiomáint in Éirinn:

source: • Pay Vehicle Registration Tax (VRT) (unless you are exempt)
ga: • Cáin Chláraithe Feithiclí (CCF) a íoc (ach amháin sa chás go bhfuil díolúine agat)

source: • Get new vehicle registration plates
ga: • Plátaí clárúcháin feithicle nua a fháil

source: All motorists are required to carry a valid driving licence with them at all times when driving in Ireland
ga: Ní mór do gach tiománaí ceadúnas bailí tiomána a bheith á iompar aige/aici i gcónaí nuair atá sé/sí ag tiomáint in Éirinn

source: Driving licences include full licences, international driving licences and Irish learner permits
ga: Áirítear le ceadúnais tiomána ceadúnais tiomána, ceadúnais tiomána idirnáisiúnta agus cead foghlaimeora Éireannach

source: Vehicle Registration Tax (VRT) is a tax you must pay when you first register a motor vehicle in Ireland
ga: Cáin nach mór duit a íoc nuair a chláraíonn tú feithicil den chéad uair in Éirinn í Cáin Chláraithe Feithiclí (CCF)

source: If you have imported a vehicle, you must pay VRT and receive the vehicle's registration certificate showing that you have paid VRT
ga: Má tá feithicil iompórtáilte agat, ní mór duit CCF a íoc agus an teastas Cláraithe feithicle don fheithicil a fháil a thaispeánann go bhfuil CCF íoctha agat

source: Any delay in registering your vehicle or paying Vehicle Registration Tax will make you liable to substantial penalties - including forfeiture of your vehicle and prosecution
ga: Gearrfar pionóis mhóra ort as aon mhoill a bheith ort d’fheithicil a chlárú nó Cáin Chláraithe Feithiclí a íoc – ina measc d’fhéadfaí an fheithicil a bhaint díot agus an dlí a chur ort

source: You must register the car and pay the VRT at a National Car Testing Service (NCTS) centre - see 'How to apply' below
ga: Ní mór duit an carr a chlárú agus Cáin Chláraithe Feithiclí a íoc ag ionad Seirbhíse Tástála Carranna Náisiúnta – féach ‘Conas iarratas a dhéanamh’ thíos

source: Your car will be examined to ensure that you are paying the correct VRT
ga: Déanfar scrúdú ar do charr chun a chinntiú go bhfuil an Cháin Chláraithe Feithiclí ceart á híoc agat

source: In the case of cars and small vans, the amount of VRT payable is based on a percentage of the recommended retail price, which includes all taxes
ga: I gcás carranna agus veaineanna beaga, tá an méid CCF iníoctha bunaithe ar chéatadán an phraghais díola atá molta, ina n-áirítear gach cáin

source: This price is known as the Open Market Selling Price (OMSP)
ga: Praghas Díola Margaidh Oscailte (PDMO) a thugtar ar an bpraghas seo

source: You can get an estimate of the VRT due from the Revenue Vehicle Registration Online Enquiry System
ga: Is féidir leat meastachán den Cháin Chláraithe Feithiclí dlite a fháil ó Chóras Fiosrúcháin ar Líne um Chlárú Feithiclí

source: When enquiring about VRT rates, you need to provide specific information about your vehicle
ga: Nuair a bhíonn fiosrú á dhéanamh agat faoi rátaí CCF, is gá duit faisnéis shonrach a sholáthar faoi d’fheithicil

source: Revenue have also produced a guide to VRT which is a list of frequently asked questions about VRT in Ireland
ga: Chuir na Coimisinéirí Ioncaim treoir i dtoll a chéile maidir le CCF atá mar liosta ceisteanna coitianta a chuirtear faoi CCF in Éirinn

source: They have also produced a guide to the CO2-based VRT for cars
ga: Anuas air sin, chuir siad treoir le chéile maidir le CCF bunaithe ar CO2 do ghluaisteáin

source: If you feel you are being over-charged, you can appeal it with Revenue using the VRT appeals procedure
ga: Má mheasann tú gur gearradh rótháille ort, is féidir leat achomharc a dhéanamh leis na Coimisinéirí Ioncaim trí úsáid a bhaint as an nós imeachta achomhairc do Cháin Chláraithe Feithiclí

source: This leaflet is also available from any local Revenue office
ga: Tá an bhileog seo ar fáil ó oifig áitiúil ar bith de chuid na gCoimisinéirí Ioncaim

source: The addresses of the appeals officers are listed at the end of the leaflet
ga: Tá liosta seoltaí oifigeach achomhairc ag deireadh an bhileog

source: There are different reliefs and exemptions from VRT
ga: Tá faoisimh agus díolúintí difriúla ó CCF ar fáil

source: Even if you are not required to pay VRT, you must still register your vehicle when you come to Ireland
ga: Fiú mura gá duit CCF a íoc, ní mór duit d’fheithicil a chlárú nuair a thagann tú go hÉirinn

source: You can find information and forms for VRT reliefs and exemptions on the Revenue website
ga: Is féidir faisnéis agus foirmeacha maidir le faoisimh agus díolúintí ó CCF a fháil ar láithreán gréasáin na gCoimisinéirí Ioncaim

source: Transferring residence: If you are moving to live in Ireland, when you apply for a VRT exemption, you must meet certain requirements as regards your vehicle and your residency both here and abroad
ga: Aistriú Áite Cónaithe: Má tá tú ag bogadh go hÉirinn, nuair déanann tú iarratas ar dhíolúine ó CCF, caithfidh tú riachtanais áirithe le haghaidh d’fheithicil agus do chónaí anseo agus thar lear a shásamh

source: You can find information about when to apply for exemption, the evidence you need and the application forms in the Revenue leaflet, Transfer of Residence
ga: Tá faisnéis maidir le conas iarratas a dhéanamh, an fhianaise atá de dhíth ort agus na foirmeacha iarratais ar fáil sa bhileog na gCoimisinéirí Ioncaim, Aistriú Áite Cónaithe

source: Temporary exemptions: In certain cases foreign-registered vehicles may be imported into Ireland temporarily by a non-resident without the requirement to pay VRT or register the vehicle
ga: Díolúintí sealadacha: I roinnt cásanna, is féidir le neamhchónaitheoir feithiclí a cláraíodh i dtír iasachta a thabhairt isteach go hÉirinn gan an gá CCF a íoc nó an fheithicil a chlárú

source: You can find information about Foreign Registered Vehicles Temporary Exemptions on the Revenue website
ga: Is féidir leat teacht ar fhaisnéis faoi Dhíolúintí Sealadacha Feithiclí a Cláraíodh i dTír Iasachta ar láithreán gréasáin na gCoimisinéirí Ioncaim

source: If you are moving to Ireland and are among those exempt from paying VRT you cannot sell your vehicle for more than 12 months after the vehicle is registered
ga: Má tá tú ag bogadh go hÉirinn agus má tá tú i measc iad siúd atá díolmhaithe ó CCF a íoc, ní féidir leat d’fheithicil a dhíol ar feadh breis agus 12 mhí tar éis go bhfuil an fheithicil cláraithe

source: If you are required to pay VRT, then you can sell your vehicle here in Ireland when you wish, once it has been registered
ga: Má tá ort CCF a íoc, is féidir leat d’fheithicil a dhíol anseo in Éirinn nuair is mian leat, a luaithe a bhíonn sí cláraithe

source: If you have a query about VRT exemptions, appeals or transfer of residence, the Revenue contact details are listed here
ga: Má tá ceist agat faoi dhíolúintí, achomhairc CCF nó aistriú áit chónaithe, tá sonraí teagmhála na gCoimisinéirí Ioncaim liostaithe anseo

source: If you are permanently removing or exporting a car from the State, you may be able to claim a repayment of the VRT that had been paid previously
ga: Má aistríonn tú carr amach as an Stát nó má easpórtáiltear é, d’fhéadfá aisíocaíocht CCF a íocadh roimhe sin a fháil

source: Information about the Export Repayment Scheme and claim forms are available on revenue.ie
ga: Tá faisnéis faoin Scéim Aisíocaíochta Easpórtála agus foirmeacha iarratais ar fáil ar revenue.ie

source: VAT, insurance, motor tax and NCT
ga: CBL, árachas, mótarcháin agus an TNC

source: If you are importing a new car from another EU country you have to pay VAT (Value Added Tax), usually when registering the car
ga: Caithfidh tú Cáin Bhreisluacha (CBL) a íoc má iompórtálann tú carr nua ó thír eile de chuid an AE, agus is ag am a chláraithe a íoctar é sin de ghnáth

source: A new car means a car that has been in service for 6 months or less, or has been driven for 6,000 kilometres or less
ga: Is ionann carr nua agus carr nár úsáideadh ar feadh tréimhse níos faide ná 6 mhí nó nár tiomáineadh níos faide ná 6,000 ciliméadar

source: The VAT is payable even where you have paid VAT in the other country
ga: Ní foláir an CBL a íoc fiú má d'íoc tú CBL sa tír eile

source: If you are importing a new or second hand car from outside the EU, VAT (and customs duty) is payable
ga: Ní mór CBL agus dleacht custaim a íoc má tá tú ag iompórtáil carr nua nó carr athláimhe ó thír lasmuigh den AE

source: Customs duty is paid when the vehicle first enters the EU, at the point of entry
ga: Íoctar dleacht custaim nuair a iontrálann an fheithicil an AE i dtosach báire, ag an bpointe iontrála

source: You must have proof of payment of this when you are registering the car in Ireland - see 'How to apply' below
ga: Ní mór duit cruthúnas íocaíochta a bheith agat ina leith seo nuair a bhíonn an carr á chlárú agat in Éirinn – féach ‘Conas iarratas a dhéanamh’ thíos

source: When you register and pay the VRT, a registration number will be assigned to your car – see ‘How to apply’ below
ga: Nuair a chláraíonn tú agus a íocann tú an CBL, sannfar uimhir chláraithe do do charr – féach ‘Conas iarratas a dhéanamh’ thíos

source: You must display the registration number within 3 days
ga: Ní mór duit an uimhir chláraithe a thaispeáint laistigh de 3 lá

source: Failure to display the new registration number is an offence and you can be fined by An Garda Síochána
ga: Má theipeann ort an uimhir nua chláraithe a thaispeáint, is cion seo agus féadfaidh an Garda Síochána fíneáil a ghearradh ort

source: You can obtain vehicle registration plates from the NCTS centre or any motor factor
ga: Is féidir leat plátaí cláraithe feithicle a fháil ón ionad STNC nó ag aon siopa earraí cairr

source: It is a legal requirement in Ireland to have motor insurance if you want to drive a motor vehicle in a public place
ga: Is ceanglas dlíthiúil é in Éirinn mótarcháin a bheith íoctha agat más mian leat feithicil a thiomáint in áit phoiblí

source: You will need to have motor insurance before you can pay motor tax
ga: Beidh ort mótarárachas a bheith agat sular féidir leat mótarcháin a íoc

source: You can find more information in our document on motor insurance
ga: Is féidir leat teacht ar thuilleadh faisnéise inár gcáipéis ar mhótarárachas

source: Motor tax in Ireland is a charge imposed by the Irish Government on motor vehicles
ga: Muirear is ea mótarcháin a ghearrann Rialtas ar mhótarfheithiclí

source: Some vehicles are exempt but must display a current tax disc if used in a public place
ga: Bíonn roinnt feithiclí díolmhaithe agus ach ní mór dóibh diosca reatha cánach a thaispeáint má úsáidtear iad in áit phoiblí

source: Your Vehicle Registration Certificate will be issued to you by the Department of Transport, Tourism and Sport when you pay your motor tax
ga: Eiseoidh an Roinn Iompair, Turasóireachta agus Spóirt do Dheimhniú Clárúcháin Feithicle duit, nuair a íocann tú do mhótarcháin

source: There is more information in our document on motor tax
ga: Is féidir leat níos mó a léamh faoi seo inár gcáipéis ar mhótarcháin

source: If your vehicle is 4 years old or more it will have to go through the National Car Test (NCT) immediately
ga: Má tá d’fheithicil 4 bliana d’aois nó níos mó, ní mór d’fheithiclí a chur faoin Tástáil Náisiúnta Carranna (TNC ) láithreach

source: This applies even if the vehicle has previously received an MOT or any other vehicle test abroad
ga: Baineann an riail seo le feithiclí a ndearnadh an Roinn Iompair, Turasóireachta agus Spóirt nó aon tástáil feithicle eile thar lear tástáil orthu roimhe seo

source: The NCT test certificate will be valid until the next test due date
ga: Beidh an deimhniú teastas tástála bailí go dtí an chéad dáta tástála dlite eile

source: After that if the vehicle is still in Ireland it must be tested again
ga: Ina dhiaidh sin, má tá an fheithicil fós in Éirinn, ní mór í a thástáil arís

source: You can find more information in our document on the National Car Test
ga: Is féidir leat teacht ar thuilleadh faisnéise inár gcáipéis ar an Tástáil Náisiúnta Carranna

source: If you want to dispose of your car either due to age (typically around 12-14 years), or because of heavy damage following an accident, it must be deposited at an authorised treatment facility
ga: Más mian leat carr a dhiúscairt toisc é a bheith sean (idir 12-14 bliana d’aois de ghnáth), nó toisc go ndearnadh an-damáiste dó i dtimpiste, ní mór é a dhiúscairt ag saoráid ceadúnaithe chóireála

source: There is more information in our document on how to dispose of an end-of-life vehicle
ga: Is féidir leat níos mó a léamh faoi seo inár gcáipéis ar conas feithicil a bhfuil a ré caite a dhiúscairt

source: Vehicle Registration Tax (VRT) is based on the Open Market Selling Price (OMSP) of the vehicle
ga: Tá Cáin Chlárúcháin Feithicle bunaithe ar 'an Praghas Díolacháin ar an Margadh Oscailte (PDMO)

source: The OMSP depends on the market value, engine size, year, model and roadworthiness condition of the vehicle
ga: Braitheann an PMDO ar luachanna an mhargaidh ag an am, aois na feithicle, méid an innill agus riocht d’fheithicle ar an mbóthar

source: After the vehicle has been inspected the rate of VRT is calculated by Revenue
ga: Tar éis don chigireacht a bheith déanta ar an bhfeithicil, ríomhann na Coimisinéirí Ioncaim an ráta Cáin Chláraithe Feithiclí

source: The VRT is collected by the NCTS on behalf of Revenue
ga: Bailíonn an Córas Náisiúnta Tástála Carranna an Cáin Chláraithe Feithiclí thar ceann na gCoimisinéirí Ioncaim

source: You can pay by bank draft (payable to Applus Car Testing Service), debit card or credit card
ga: Is féidir leat íoc le dréacht bainc (iníoctha le Applus Car Testing Service), cárta dochair nó cárta creidmheasa

source: If you are using a debit card to pay, the transaction is limited to €2,500 per day
ga: Más cárta dochair atá in úsáid agat, ní féidir leat ach €2,500 a íoc in aon lá amháin

source: If the VRT payment exceeds this amount, you can pay the balance by bank draft
ga: Má tá an CCF iníoctha níos mó ná seo, is féidir leat an fuílleach a íoc le hordú bainc

source: VRT for cars (Category A) is based on the level of CO2 emissions from the car
ga: Tá CCF do charranna (cineál A) bunaithe ar leibhéil astaithe CO2 ón gca

source: On the Sustainable Energy Authority of Ireland's (SEAI) website you can check the CO2 emissions levels for different car models
ga: Féach an láithreáin gréasáin Údarás Fuinneamh Inbhuanaithe Éireann chun leibhéil astaithe CO2 do samplacha charranna difriúla a fheiceáil

source: VRT rates for Category A vehicles
ga: Rátaí CCF do fheithiclí Cineál A

source: │ │CO2 emissions levels │VRT rates │
ga: │ │Leibhéil astaithe CO2 │Rátaí CCF │

source: │Band A1 │0 - 80 grams per kilometre │14% of OMSP (minimum €280) │
ga: │Banda A1 │0 - 80 graim sa chiliméadar │14% den PDMO, (faoi réir ag íoscháin de €280) │

source: │Band A2 │81 – 100 grams per kilometre │15% of OMSP (minimum €300) │
ga: │Banda A2 │81-100 graim sa chiliméadar │15% den PDMO, (faoi réir ag íoscháin de €300) │

source: │Band A3 │101 – 110 grams per kilometre │16% of OMSP (minimum €320) │
ga: │Banda A3 │101-110 graim sa chiliméadar │16% den PDMO, (faoi réir ag íoscháin de €320) │

source: │Band A4 │111 – 120 grams per kilometre │17% of OMSP (minimum €340) │
ga: │Banda A4 │111-120 graim sa chiliméadar │17% den PDMO, (faoi réir ag íoscháin de €340) │

source: │Band B1 │121 – 130 grams per kilometre │18% of OMSP (minimum €360) │
ga: │Banda B1 │121-140 graim sa chiliméadar │18% den PDMO, (faoi réir ag íoscháin de €360) │

source: │Band B2 │131 – 140 grams per kilometre │19% of OMSP (minimum €380) │
ga: │Banda B2 │121-140 graim sa chiliméadar │19% den PDMO, (faoi réir ag íoscháin de €380) │

source: │Band C │141 – 155 grams per kilometre │23% of OMSP (minimum €460) │
ga: │Banda C │141-155 graim sa chiliméadar │23% den PDMO, (faoi réir ag íoscháin de €460) │

source: │Band D │156 – 170 grams per kilometre │27% of OMSP (minimum €540) │
ga: │Banda D │156-170 graim sa chiliméadar │27% den PDMO, (faoi réir ag íoscháin de €540) │

source: │Band E │171 – 190 grams per kilometre │30% of OMSP (minimum €600) │
ga: │Banda E │171-190 graim sa chiliméadar │30% den PDMO, (faoi réir ag íoscháin de €600) │

source: │Band F │191 – 225 grams per kilometre │34% of OMSP (minimum €680) │
ga: │Banda F │191-225 graim sa chiliméadar │34% den PDMO, (faoi réir ag íoscháin de €680) │

source: │Band G │over 225 grams per kilometre │36% of OMSP (minimum €720) │
ga: │Banda G │os cionn 225 graim sa chiliméadar │36% den PDMO, (faoi réir ag íoscháin de €720) │

source: Vehicle Registration Tax rates for all other categories
ga: Rátaí Cáin Chlárúcháin Feithicle do gach cineál eile

source: │Category│Vehicle │VRT rate │
ga: │Cineál│Feithicil │Costas CCF │

source: │B │Car derived and jeep derived vans │13.3% of OMSP (subject to a minimum tax of €125) │
ga: │B │Veaineanna dhíorthaithe ó carranna agus │13.3% den PDMO (faoi réir ag íoscháin de │

source: │C │Other vehicles such as tractors, large vans, lorries, vintage cars (over 30 years old), minibuses (minimum 12 passenger seats) │Flat rate of €200 │
ga: │C │veaineanna móra, carranna seanré (os │Bunráta €200 │ │ │cionn 30 bliain), mionbhus (íosmhéid 12 │ │

source: │ │Motor caravans/motor homes │13.3% of OMSP │
ga: │ │Carbháin mótar/mótarthithe │13.3% de PDMO │

source: │ │Motorcycles (new) │€2 per cc up to 350cc and €1 per cc thereafter │
ga: │ │Gluaisrothair (nua) │€2 in aghaidh cc suas go dtí 350cc agus €1 │

source: │ │Motorcycles (used) │As for new
ga: │ │ │Mar an gcéanna le cinn nua

source: Total amount is then reduced by percentage depending on age (over 30 years 100% reduction) │
ga: │ │ │ar aois. (Os cionn 30 bliana 100% laghdú) │

source: │ │Hybrid electric vehicles and flexible fuel vehicles* │VRT relief of up to €1,500 depending on the age of the car in respect of certain series production vehicles until 31 December 2018 │
ga: │ │agus breosla solúbtha* │roinnt feithiclí baisctháirgthe áirithe go │ │ │ │dtí 31 Nollaig 2018 │

source: │ │Plug-in hybrid electric vehicles** │VRT relief of up to €2,500 depending on the age of the car in respect of certain series production vehicles until 31 December 2018 │
ga: │ │Feithiclí hibride leictreacha plugála** │roinnt feithiclí baisctháirgthe áirithe go │ │ │ │dtí 31 Nollaig 2018 │

source: │ │Electric vehicles*** │VRT relief of up to €5,000 depending on the age of the car in respect of certain series production vehicles until 31 December 2021 │
ga: │ │Feithiclí leictreacha*** │roinnt feithiclí baisctháirgthe áirithe go │ │ │ │dtí 31 Nollaig 2021 │

source: │ │Electric motorcycles*** │Exempt from VRT until 31 December 2021 │
ga: │ │Gluaisrothair leictreacha*** │Díolúine ó CCF go dtí 31 Nollaig 2021 │

source: *A hybrid electric vehicle derives its power from a combination of an electric motor and an internal combustion engine and is capable of being driven on electronic propulsion alone for a material part of its normal driving cycle
ga: *Feithicil a fhaigheann cumhacht ó mhótar leictreach agus ó inneall dócháin inmhéanaigh í feithicil leictreach croschineálach. Is féidir í a thiomáint ar leictreachas amháin ar feadh cuid mhaith den ghnáth thréimhse tiomána

source: A flexible fuel vehicle has an engine capable of using a blend of ethanol (minimum 80%) and petrol
ga: Is féidir le inneall feithiclí breosla solúbtha cumasc petril agus eatánól (íosmhéid 80%) a usáid

source: **A plug-in hybrid electric vehicle derives its motive power from a combination of an electric motor and an internal combustion engine, where the electric motor derives its power from a battery that may be charged from the internal combustion engine and an alternating current (AC) electric mains supply and is capable of being driven on electric propulsion alone for a material part of its normal driving cycle
ga: **Ciallaíonn feithicil leictreach hibrideach plugála feithicil sraith-tháirgthe a fhaigheann a cumhacht mhótair ó mheascán de mhótar leictreach agus inneall dócháin inmheánaigh, áit a bhfaigheann an mótar leictreach a chumhacht ó cheallra is féidir a luchtú ón inneall dócháin inmheánaigh agus ó phríomlíonra leictreachais srutha ailtéarnaigh (AC) agus is féidir a thiomáint ar leictreachas amháin ar feadh cuid mhaith dá ghnáth-thimthriall tiomána

source: ***An electric vehicle/motorcycle is propelled by an electric motor only
ga: ***Tá feithiclí agus gluaisrothair leictreacha a thiomáint ar leictreachas amháin

source: In order to register and pay the VRT you must bring your car for an inspection to your local designated NCTS centre
ga: Ní mór duit do charr a thabhairt chuig d’ionad áitiúil ainmnithe de chuid na Seirbhíse Tástála Náisiúnta Carranna chun clárú agus an Cháin Chláraithe Feithiclí a íoc

source: You must book an appointment with the NCTS within 7 days of your car's arrival into Ireland and you must complete the registration process within 30 days of your arrival
ga: Ní mór duit coinne a chur in áirithe leis an STNC taobh istigh de 7 lá ón uair a thugtar an carr go hÉirinn agus an próiseas clárúcháin istigh de 30 lá ó do theacht a chomhlánú

source: Since 12 September 2016, all new motor vehicles (i.e
ga: Ón 12 Meán Fómhair 2016 ar aghaidh, tá ar gach mótarfheithicil nua (i.e

source: vehicles not previously registered) being registered for the first time in Ireland are required to have an electronic Certificate of Conformity (e-CoC)
ga: feithiclí nár cláraíodh cheana) a chláraítear den chéad uair in Éirinn Deimhniú Comhréireachta leictreonach (ríomh-DC) a bheith acu

source: Before your vehicle is registered, if you only have a paper version of your e-CoC, you must manually input the details onto the Revenue system
ga: Sula gcláraítear d’fheithicil, mura bhfuil ach leagan páipéir agat de do ríomh-DC, caithfidh tú na sonraí a ionchur de láimh ar chóras na gCoimisinéirí Ioncaim

source: You can find guidelines (pdf) on revenue.ie
ga: Féadfaidh tú teacht ar threoirlínte (pdf) ar revenue.ie

source: You must have a Personal Public Service Number (PPS number), proof of identity (for example your passport or driving licence) and other specified documents in order to register and pay the VRT
ga: Caithfidh tú Uimhir Phearsanta Seirbhíse Poiblí, cruthúnas aitheantais (mar shampla, do phas nó do cheadúnas tiomána) agus cáipéisí eile a shonraítear a bheith agat chun an CCF a íoc agus a chlárú

source: There is a list of the documents required on revenue.ie
ga: Tá fáil ar liosta den cháipéisíocht riachtanach ar revenue.ie

source: You must also be able to locate the chassis number for the vehicle inspector when presenting the vehicle for inspection
ga: Ní mór duit a bheith in ann an uimhir fonnaidh a aimsiú do chigire na feithicle nuair a thugann tú an fheithicil i láthair don chigireacht
